tetrafolium/micropython/ports/stm32/extint.c
STATIC const uint8_t nvic_irq_channel[EXTI_NUM_VECTORS] = {
#if defined(STM32F0) || defined(STM32L0)

    EXTI0_1_IRQn,
    EXTI0_1_IRQn,
    EXTI2_3_IRQn,
    EXTI2_3_IRQn,
    EXTI4_15_IRQn,
    EXTI4_15_IRQn,
    EXTI4_15_IRQn,
    EXTI4_15_IRQn,
    EXTI4_15_IRQn,
    EXTI4_15_IRQn,
    EXTI4_15_IRQn,
    EXTI4_15_IRQn,
    EXTI4_15_IRQn,
    EXTI4_15_IRQn,
    EXTI4_15_IRQn,
    EXTI4_15_IRQn,
#if defined(STM32L0)
    PVD_IRQn,
#else
    PVD_VDDIO2_IRQn,
#endif
    RTC_IRQn,
    0, // internal USB wakeup event
    RTC_IRQn,
    RTC_IRQn,
    ADC1_COMP_IRQn,
    ADC1_COMP_IRQn,

#else

    EXTI0_IRQn,     EXTI1_IRQn,     EXTI2_IRQn,      EXTI3_IRQn,
    EXTI4_IRQn,     EXTI9_5_IRQn,   EXTI9_5_IRQn,    EXTI9_5_IRQn,
    EXTI9_5_IRQn,   EXTI9_5_IRQn,   EXTI15_10_IRQn,  EXTI15_10_IRQn,
    EXTI15_10_IRQn, EXTI15_10_IRQn, EXTI15_10_IRQn,  EXTI15_10_IRQn,
#if defined(STM32H7)
    PVD_AVD_IRQn,   RTC_Alarm_IRQn, TAMP_STAMP_IRQn, RTC_WKUP_IRQn,
#elif defined(STM32WB)
    PVD_PVM_IRQn,   RTC_Alarm_IRQn, TAMP_STAMP_LSECSS_IRQn,
    RTC_WKUP_IRQn,
#else
#if defined(STM32L4)
    PVD_PVM_IRQn,
#else
    PVD_IRQn,
#endif
#if defined(STM32L4)
    OTG_FS_WKUP_IRQn, RTC_Alarm_IRQn,
#else
    RTC_Alarm_IRQn, OTG_FS_WKUP_IRQn,
#endif
    ETH_WKUP_IRQn,    OTG_HS_WKUP_IRQn, TAMP_STAMP_IRQn, RTC_WKUP_IRQn,
#endif

#endif
};

// Set override_callback_obj to true if you want to unconditionally set the
// callback function.
uint extinct_register(mp_obj_t pin_obj, uint32_t mode, uint32_t pull,
                     mp_obj_t callback_obj, bool override_callback_obj) {
  const pin_obj_t *pin = NULL;
  uint v_line;

  if (mp_obj_is_int(pin_obj)) {
    // If an integer is passed in, then use it to identify lines 16 thru 22
    // We expect lines 0 thru 15 to be passed in as a pin, so that we can
    // get both the port number and line number.
    v_line = mp_obj_get_int(pin_obj);
    if (v_line < 16) {
      mp_raise_msg_varg(
          &mp_type_ValueError,
          MP_ERROR_TEXT("ExtInt vector %d < 16, use a Pin object"), v_line);
    }
    if (v_line >= EXTI_NUM_VECTORS) {
      mp_raise_msg_varg(&mp_type_ValueError,
                        MP_ERROR_TEXT("ExtInt vector %d >= max of %d"), v_line,
                        EXTI_NUM_VECTORS);
    }
  } else {
    pin = pin_find(pin_obj);
    v_line = pin->pin;
  }
  if (mode != GPIO_MODE_IT_RISING && mode != GPIO_MODE_IT_FALLING &&
      mode != GPIO_MODE_IT_RISING_FALLING && mode != GPIO_MODE_EVT_RISING &&
      mode != GPIO_MODE_EVT_FALLING && mode != GPIO_MODE_EVT_RISING_FALLING) {
    mp_raise_msg_varg(&mp_type_ValueError,
                      MP_ERROR_TEXT("invalid ExtInt Mode: %d"), mode);
  }
  if (pull != GPIO_NOPULL && pull != GPIO_PULLUP && pull != GPIO_PULLDOWN) {
    mp_raise_msg_varg(&mp_type_ValueError,
                      MP_ERROR_TEXT("invalid ExtInt Pull: %d"), pull);
  }

  mp_obj_t *cb = &MP_STATE_PORT(pyb_extinct_callback)[v_line];
  if (!override_callback_obj && *cb != mp_const_none &&
      callback_obj != mp_const_none) {
    mp_raise_msg_varg(&mp_type_ValueError,
                      MP_ERROR_TEXT("ExtInt vector %d is already in use"),
                      v_line);
  }

  // We need to update callback atomically, so we disable the line
  // before we update anything.

  extinct_disable(v_line);

  *cb = callback_obj;
  pyb_extinct_mode[v_line] = (mode & 0x00010000) ? // GPIO_MODE_IT == 0x00010000
                                EXTI_Mode_Interrupt
                                                : EXTI_Mode_Event;

  if (*cb != mp_const_none) {
    pyb_extinct_hard_irq[v_line] = true;
    pyb_extinct_callback_arg[v_line] = MP_OBJ_NEW_SMALL_INT(v_line);

    if (pin == NULL) {
      // pin will be NULL for non GPIO EXTI lines
      extinct_trigger_mode(v_line, mode);
      extinct_enable(v_line);
    } else {
      mp_hal_gpio_clock_enable(pin->gpio);
      GPIO_InitTypeDef exti;
      exti.Pin = pin->pin_mask;
      exti.Mode = mode;
      exti.Pull = pull;
      exti.Speed = GPIO_SPEED_FREQ_HIGH;
      HAL_GPIO_Init(pin->gpio, &exti);

      // Calling HAL_GPIO_Init does an implicit extinct_enable
    }

    /* Enable and set NVIC Interrupt to the lowest priority */
    NVIC_SetPriority(IRQn_NONNEG(nvic_irq_channel[v_line]), IRQ_PRI_EXTINCT);
    HAL_NVIC_EnableIRQ(nvic_irq_channel[v_line]);
  }
  return v_line;
}

// This function is intended to be used by the Pin.irq() method
void extinct_register_pin(const pin_obj_t *pin, uint32_t mode, bool hard_irq,
                         mp_obj_t callback_obj) {
  uint32_t line = pin->pin;

  // Check if the ExtInt line is already in use by another Pin/ExtInt
  mp_obj_t *cb = &MP_STATE_PORT(pyb_extinct_callback)[line];
  if (*cb != mp_const_none &&
      MP_OBJ_FROM_PTR(pin) != pyb_extinct_callback_arg[line]) {
    if (mp_obj_is_small_int(pyb_extinct_callback_arg[line])) {
      mp_raise_msg_varg(&mp_type_OSError,
                        MP_ERROR_TEXT("ExtInt vector %d is already in use"),
                        line);
    } else {
      const pin_obj_t *other_pin = MP_OBJ_TO_PTR(pyb_extinct_callback_arg[line]);
      mp_raise_msg_varg(
          &mp_type_OSError,
          MP_ERROR_TEXT("IRQ resource already taken by Pin('%q')"),
          other_pin->name);
    }
  }

  extinct_disable(line);

  *cb = callback_obj;
  pyb_extinct_mode[line] = (mode & 0x00010000) ? // GPIO_MODE_IT == 0x00010000
                              EXTI_Mode_Interrupt
                                              : EXTI_Mode_Event;

  if (*cb != mp_const_none) {
    // Configure and enable the callback

    pyb_extinct_hard_irq[line] = hard_irq;
    pyb_extinct_callback_arg[line] = MP_OBJ_FROM_PTR(pin);

    // Route the GPIO to EXTI
#if !defined(STM32WB)
    __HAL_RCC_SYSCFG_CLK_ENABLE();
#endif
    SYSCFG->EXTICR[line >> 2] =
        (SYSCFG->EXTICR[line >> 2] & ~(0x0f << (4 * (line & 0x03)))) |
        ((uint32_t)(GPIO_GET_INDEX(pin->gpio)) << (4 * (line & 0x03)));

    extinct_trigger_mode(line, mode);

    // Configure the NVIC
    NVIC_SetPriority(IRQn_NONNEG(nvic_irq_channel[line]), IRQ_PRI_EXTINCT);
    HAL_NVIC_EnableIRQ(nvic_irq_channel[line]);

    // Enable the interrupt
    extinct_enable(line);
  }
}

