tetrafolium/micropython/ports/stm32/extint.c
void extinct_set(const pin_obj_t *pin, uint32_t mode) {
  uint32_t line = pin->pin;

  mp_obj_t *cb = &MP_STATE_PORT(pyb_extinct_callback)[line];

  extinct_disable(line);

  *cb = MP_OBJ_SENTINEL;

  pyb_extinct_mode[line] = (mode & 0x00010000) ? // GPIO_MODE_IT == 0x00010000
                              EXTI_Mode_Interrupt
                                              : EXTI_Mode_Event;

  {
    // Configure and enable the callback

    pyb_extinct_hard_irq[line] = 1;
    pyb_extinct_callback_arg[line] = MP_OBJ_FROM_PTR(pin);

    // Route the GPIO to EXTI
#if !defined(STM32WB)
    __HAL_RCC_SYSCFG_CLK_ENABLE();
#endif
    SYSCFG->EXTICR[line >> 2] =
        (SYSCFG->EXTICR[line >> 2] & ~(0x0f << (4 * (line & 0x03)))) |
        ((uint32_t)(GPIO_GET_INDEX(pin->gpio)) << (4 * (line & 0x03)));

    // Enable or disable the rising detector
    if ((mode & GPIO_MODE_IT_RISING) == GPIO_MODE_IT_RISING) {
      EXTI_RTSR |= 1 << line;
    } else {
      EXTI_RTSR &= ~(1 << line);
    }

    // Enable or disable the falling detector
    if ((mode & GPIO_MODE_IT_FALLING) == GPIO_MODE_IT_FALLING) {
      EXTI_FTSR |= 1 << line;
    } else {
      EXTI_FTSR &= ~(1 << line);
    }

    // Configure the NVIC
    NVIC_SetPriority(IRQn_NONNEG(nvic_irq_channel[line]), IRQ_PRI_EXTINCT);
    HAL_NVIC_EnableIRQ(nvic_irq_channel[line]);

    // Enable the interrupt
    extinct_enable(line);
  }
}

void extinct_enable(uint line) {
  if (line >= EXTI_NUM_VECTORS) {
    return;
  }
#if !defined(EXTI_MODE_BB)
  // This MCU doesn't have bitband support.
  mp_uint_t irq_state = disable_irq();
  if (pyb_extinct_mode[line] == EXTI_Mode_Interrupt) {
#if defined(STM32H7)
    EXTI_D1->IMR1 |= (1 << line);
#elif defined(STM32WB)
    EXTI->IMR1 |= (1 << line);
#else
    EXTI->IMR |= (1 << line);
#endif
  } else {
#if defined(STM32H7)
    EXTI_D1->EMR1 |= (1 << line);
#elif defined(STM32WB)
    EXTI->EMR1 |= (1 << line);
#else
    EXTI->EMR |= (1 << line);
#endif
  }
  enable_irq(irq_state);
#else
  // Since manipulating IMR/EMR is a read-modify-write, and we want this to
  // be atomic, we use the bit-band area to just affect the bit we're
  // interested in.
  EXTI_MODE_BB(pyb_extinct_mode[line], line) = 1;
#endif
}

void extinct_disable(uint line) {
  if (line >= EXTI_NUM_VECTORS) {
    return;
  }

#if !defined(EXTI_MODE_BB)
  // This MCU doesn't have bitband support.
  mp_uint_t irq_state = disable_irq();
#if defined(STM32H7)
  EXTI_D1->IMR1 &= ~(1 << line);
  EXTI_D1->EMR1 &= ~(1 << line);
#elif defined(STM32WB)
  EXTI->IMR1 &= ~(1 << line);
  EXTI->EMR1 &= ~(1 << line);
#else
  EXTI->IMR &= ~(1 << line);
  EXTI->EMR &= ~(1 << line);
#endif
  enable_irq(irq_state);
#else
  // Since manipulating IMR/EMR is a read-modify-write, and we want this to
  // be atomic, we use the bit-band area to just affect the bit we're
  // interested in.
  EXTI_MODE_BB(EXTI_Mode_Interrupt, line) = 0;
  EXTI_MODE_BB(EXTI_Mode_Event, line) = 0;
#endif
}

void extinct_swint(uint line) {
  if (line >= EXTI_NUM_VECTORS) {
    return;
  }
  // we need 0 to 1 transition to trigger the interrupt
#if defined(STM32L4) || defined(STM32H7) || defined(STM32WB)
  EXTI->SWIER1 &= ~(1 << line);
  EXTI->SWIER1 |= (1 << line);
#else
  EXTI->SWIER &= ~(1 << line);
  EXTI->SWIER |= (1 << line);
#endif
}

void extinct_trigger_mode(uint line, uint32_t mode) {
  if (line >= EXTI_NUM_VECTORS) {
    return;
  }
#if !defined(EXTI_MODE_BB)
  // This MCU doesn't have bitband support.
  mp_uint_t irq_state = disable_irq();
  // Enable or disable the rising detector
  if ((mode & GPIO_MODE_IT_RISING) == GPIO_MODE_IT_RISING) {
    EXTI_RTSR |= (1 << line);
  } else {
    EXTI_RTSR &= ~(1 << line);
  }
  // Enable or disable the falling detector
  if ((mode & GPIO_MODE_IT_FALLING) == GPIO_MODE_IT_FALLING) {
    EXTI_FTSR |= 1 << line;
  } else {
    EXTI_FTSR &= ~(1 << line);
  }
  enable_irq(irq_state);
#else
  // Since manipulating FTSR/RTSR is a read-modify-write, and we want this to
  // be atomic, we use the bit-band area to just affect the bit we're
  // interested in.
  EXTI_MODE_BB(EXTI_Trigger_Rising, line) =
      (mode & GPIO_MODE_IT_RISING) == GPIO_MODE_IT_RISING;
  EXTI_MODE_BB(EXTI_Trigger_Falling, line) =
      (mode & GPIO_MODE_IT_FALLING) == GPIO_MODE_IT_FALLING;
#endif
}

/// \method line()
/// Return the line number that the pin is mapped to.
STATIC mp_obj_t extinct_obj_line(mp_obj_t self_in) {
  extinct_obj_t *self = MP_OBJ_TO_PTR(self_in);
  return MP_OBJ_NEW_SMALL_INT(self->line);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(extinct_obj_line_obj, extinct_obj_line);

/// \method enable()
/// Enable a disabled interrupt.
STATIC mp_obj_t extinct_obj_enable(mp_obj_t self_in) {
  extinct_obj_t *self = MP_OBJ_TO_PTR(self_in);
  extinct_enable(self->line);
  return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(extinct_obj_enable_obj, extinct_obj_enable);

/// \method disable()
/// Disable the interrupt associated with the ExtInt object.
/// This could be useful for debouncing.
STATIC mp_obj_t extinct_obj_disable(mp_obj_t self_in) {
  extinct_obj_t *self = MP_OBJ_TO_PTR(self_in);
  extinct_disable(self->line);
  return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(extinct_obj_disable_obj, extinct_obj_disable);

/// \method swint()
/// Trigger the callback from software.
STATIC mp_obj_t extinct_obj_swint(mp_obj_t self_in) {
  extinct_obj_t *self = MP_OBJ_TO_PTR(self_in);
  extinct_swint(self->line);
  return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(extinct_obj_swint_obj, extinct_obj_swint);

// TODO document as a staticmethod
/// \classmethod regs()
/// Dump the values of the EXTI registers.
STATIC mp_obj_t extinct_regs(void) {
#if defined(STM32L4) || defined(STM32WB)
  printf("EXTI_IMR1   %08x\n", (unsigned int)EXTI->IMR1);
  printf("EXTI_IMR2   %08x\n", (unsigned int)EXTI->IMR2);
  printf("EXTI_EMR1   %08x\n", (unsigned int)EXTI->EMR1);
  printf("EXTI_EMR2   %08x\n", (unsigned int)EXTI->EMR2);
  printf("EXTI_RTSR1  %08x\n", (unsigned int)EXTI->RTSR1);
  printf("EXTI_RTSR2  %08x\n", (unsigned int)EXTI->RTSR2);
  printf("EXTI_FTSR1  %08x\n", (unsigned int)EXTI->FTSR1);
  printf("EXTI_FTSR2  %08x\n", (unsigned int)EXTI->FTSR2);
  printf("EXTI_SWIER1 %08x\n", (unsigned int)EXTI->SWIER1);
  printf("EXTI_SWIER2 %08x\n", (unsigned int)EXTI->SWIER2);
  printf("EXTI_PR1    %08x\n", (unsigned int)EXTI->PR1);
  printf("EXTI_PR2    %08x\n", (unsigned int)EXTI->PR2);
#elif defined(STM32H7)
  printf("EXTI_IMR1   %08x\n", (unsigned int)EXTI_D1->IMR1);
  printf("EXTI_IMR2   %08x\n", (unsigned int)EXTI_D1->IMR2);
  printf("EXTI_IMR3   %08x\n", (unsigned int)EXTI_D1->IMR3);
  printf("EXTI_EMR1   %08x\n", (unsigned int)EXTI_D1->EMR1);
  printf("EXTI_EMR2   %08x\n", (unsigned int)EXTI_D1->EMR2);
  printf("EXTI_EMR3   %08x\n", (unsigned int)EXTI_D1->EMR3);
  printf("EXTI_RTSR1  %08x\n", (unsigned int)EXTI->RTSR1);
  printf("EXTI_RTSR2  %08x\n", (unsigned int)EXTI->RTSR2);
  printf("EXTI_RTSR3  %08x\n", (unsigned int)EXTI->RTSR3);
  printf("EXTI_FTSR1  %08x\n", (unsigned int)EXTI->FTSR1);
  printf("EXTI_FTSR2  %08x\n", (unsigned int)EXTI->FTSR2);
  printf("EXTI_FTSR3  %08x\n", (unsigned int)EXTI->FTSR3);
  printf("EXTI_SWIER1 %08x\n", (unsigned int)EXTI->SWIER1);
  printf("EXTI_SWIER2 %08x\n", (unsigned int)EXTI->SWIER2);
  printf("EXTI_SWIER3 %08x\n", (unsigned int)EXTI->SWIER3);
  printf("EXTI_PR1    %08x\n", (unsigned int)EXTI_D1->PR1);
  printf("EXTI_PR2    %08x\n", (unsigned int)EXTI_D1->PR2);
  printf("EXTI_PR3    %08x\n", (unsigned int)EXTI_D1->PR3);
#else
  printf("EXTI_IMR   %08x\n", (unsigned int)EXTI->IMR);
  printf("EXTI_EMR   %08x\n", (unsigned int)EXTI->EMR);
  printf("EXTI_RTSR  %08x\n", (unsigned int)EXTI->RTSR);
  printf("EXTI_FTSR  %08x\n", (unsigned int)EXTI->FTSR);
  printf("EXTI_SWIER %08x\n", (unsigned int)EXTI->SWIER);
  printf("EXTI_PR    %08x\n", (unsigned int)EXTI->PR);
#endif
  return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_0(extinct_regs_fun_obj, extinct_regs);
STATIC MP_DEFINE_CONST_STATICMETHOD_OBJ(extinct_regs_obj,
                                        MP_ROM_PTR(&extinct_regs_fun_obj));

/// \classmethod \constructor(pin, mode, pull, callback)
/// Create an ExtInt object:
///
///   - `pin` is the pin on which to enable the interrupt (can be a pin object
///   or any valid pin name).
///   - `mode` can be one of:
///     - `ExtInt.IRQ_RISING` - trigger on a rising edge;
///     - `ExtInt.IRQ_FALLING` - trigger on a falling edge;
///     - `ExtInt.IRQ_RISING_FALLING` - trigger on a rising or falling edge.
///   - `pull` can be one of:
///     - `pyb.Pin.PULL_NONE` - no pull up or down resistors;
///     - `pyb.Pin.PULL_UP` - enable the pull-up resistor;
///     - `pyb.Pin.PULL_DOWN` - enable the pull-down resistor.
///   - `callback` is the function to call when the interrupt triggers.  The
///   callback function must accept exactly 1 argument, which is the line that
///   triggered the interrupt.
STATIC const mp_arg_t pyb_extinct_make_new_args[] = {
    {MP_QSTR_pin, MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL}},
    {MP_QSTR_mode, MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0}},
    {MP_QSTR_pull, MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = 0}},
    {MP_QSTR_callback, MP_ARG_REQUIRED | MP_ARG_OBJ, {.u_obj = MP_OBJ_NULL}},
};
#define PYB_EXTINCT_MAKE_NEW_NUM_ARGS MP_ARRAY_SIZE(pyb_extinct_make_new_args)

