tetrafolium/micropython/ports/stm32/extint.c
STATIC mp_obj_t extinct_make_new(const mp_obj_type_t *type, size_t n_args,
                                size_t n_kw, const mp_obj_t *args) {
  // type_in == extinct_obj_type

  // parse args
  mp_arg_val_t vals[PYB_EXTINCT_MAKE_NEW_NUM_ARGS];
  mp_arg_parse_all_kw_array(n_args, n_kw, args, PYB_EXTINCT_MAKE_NEW_NUM_ARGS,
                            pyb_extinct_make_new_args, vals);

  extinct_obj_t *self = m_new_obj(extinct_obj_t);
  self->base.type = type;
  self->line = extinct_register(vals[0].u_obj, vals[1].u_int, vals[2].u_int,
                               vals[3].u_obj, false);

  return MP_OBJ_FROM_PTR(self);
}

STATIC void extinct_obj_print(const mp_print_t *print, mp_obj_t self_in,
                             mp_print_kind_t kind) {
  extinct_obj_t *self = MP_OBJ_TO_PTR(self_in);
  mp_printf(print, "<ExtInt line=%u>", self->line);
}

STATIC const mp_rom_map_elem_t extinct_locals_dict_table[] = {
    {MP_ROM_QSTR(MP_QSTR_line), MP_ROM_PTR(&extinct_obj_line_obj)},
    {MP_ROM_QSTR(MP_QSTR_enable), MP_ROM_PTR(&extinct_obj_enable_obj)},
    {MP_ROM_QSTR(MP_QSTR_disable), MP_ROM_PTR(&extinct_obj_disable_obj)},
    {MP_ROM_QSTR(MP_QSTR_swint), MP_ROM_PTR(&extinct_obj_swint_obj)},
    {MP_ROM_QSTR(MP_QSTR_regs), MP_ROM_PTR(&extinct_regs_obj)},

    // class constants
    /// \constant IRQ_RISING - interrupt on a rising edge
    /// \constant IRQ_FALLING - interrupt on a falling edge
    /// \constant IRQ_RISING_FALLING - interrupt on a rising or falling edge
    {MP_ROM_QSTR(MP_QSTR_IRQ_RISING), MP_ROM_INT(GPIO_MODE_IT_RISING)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_FALLING), MP_ROM_INT(GPIO_MODE_IT_FALLING)},
    {MP_ROM_QSTR(MP_QSTR_IRQ_RISING_FALLING),
     MP_ROM_INT(GPIO_MODE_IT_RISING_FALLING)},
    {MP_ROM_QSTR(MP_QSTR_EVT_RISING), MP_ROM_INT(GPIO_MODE_EVT_RISING)},
    {MP_ROM_QSTR(MP_QSTR_EVT_FALLING), MP_ROM_INT(GPIO_MODE_EVT_FALLING)},
    {MP_ROM_QSTR(MP_QSTR_EVT_RISING_FALLING),
     MP_ROM_INT(GPIO_MODE_EVT_RISING_FALLING)},
};

STATIC MP_DEFINE_CONST_DICT(extinct_locals_dict, extinct_locals_dict_table);

const mp_obj_type_t extinct_type = {
    {&mp_type_type},
    .name = MP_QSTR_ExtInt,
    .print = extinct_obj_print,
    .make_new = extinct_make_new,
    .locals_dict = (mp_obj_dict_t *)&extinct_locals_dict,
};

void extinct_init0(void) {
  for (int i = 0; i < PYB_EXTI_NUM_VECTORS; i++) {
    if (MP_STATE_PORT(pyb_extinct_callback)[i] == MP_OBJ_SENTINEL) {
      continue;
    }
    MP_STATE_PORT(pyb_extinct_callback)[i] = mp_const_none;
    pyb_extinct_mode[i] = EXTI_Mode_Interrupt;
  }
}

// Interrupt handler
void Handle_EXTI_Irq(uint32_t line) {
  if (__HAL_GPIO_EXTI_GET_FLAG(1 << line)) {
    __HAL_GPIO_EXTI_CLEAR_FLAG(1 << line);
    if (line < EXTI_NUM_VECTORS) {
      mp_obj_t *cb = &MP_STATE_PORT(pyb_extinct_callback)[line];
#if MICROPY_PY_NETWORK_CYW43 && defined(pyb_pin_WL_HOST_WAKE)
      if (pyb_extinct_callback_arg[line] ==
          MP_OBJ_FROM_PTR(pyb_pin_WL_HOST_WAKE)) {
        extern void (*cyw43_poll)(void);
        if (cyw43_poll) {
          pendsv_schedule_dispatch(PENDSV_DISPATCH_CYW43, cyw43_poll);
        }
        return;
      }
#endif
      if (*cb != mp_const_none) {
        // If it's a soft IRQ handler then just schedule callback for later
        if (!pyb_extinct_hard_irq[line]) {
          mp_sched_schedule(*cb, pyb_extinct_callback_arg[line]);
          return;
        }

        mp_sched_lock();
        // When executing code within a handler we must lock the GC to prevent
        // any memory allocations.  We must also catch any exceptions.
        gc_lock();
        nlr_buf_t nlr;
        if (nlr_push(&nlr) == 0) {
          mp_call_function_1(*cb, pyb_extinct_callback_arg[line]);
          nlr_pop();
        } else {
          // Uncaught exception; disable the callback so it doesn't run again.
          *cb = mp_const_none;
          extinct_disable(line);
          mp_printf(MICROPY_ERROR_PRINTER,
                    "uncaught exception in ExtInt interrupt handler line %u\n",
                    (unsigned int)line);
          mp_obj_print_exception(&mp_plat_print, MP_OBJ_FROM_PTR(nlr.ret_val));
        }
        gc_unlock();
        mp_sched_unlock();
      }
    }
  }
}
